Revit 2024 API
CameraInfo Class
 An object holding information about the projection mapping of a 3D view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class CameraInfo : IDisposable
Visual Basic
Public Class CameraInfo _
	Implements IDisposable
Visual C++
public ref class CameraInfo : IDisposable
Remarks
CameraInfo can be obtained directly from a ViewNode If camera info is not available, an orthographic view should be assumed.
 See also: [!:Autodesk::Revit::DB::IExportContext::OnViewBegin].
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.CameraInfo
See Also
CameraInfo Members
Autodesk.Revit.DB Namespace